SoCXin/HC32F4A0/src/hc32f4a0tihb_template/common/hc32f4a0tihb.h
/*  Bit definition for GPIO_POSRC register  */
#define GPIO_POSRC_POS00_POS                           (0U)
#define GPIO_POSRC_POS00                               (0x0001U)
#define GPIO_POSRC_POS01_POS                           (1U)
#define GPIO_POSRC_POS01                               (0x0002U)
#define GPIO_POSRC_POS02_POS                           (2U)
#define GPIO_POSRC_POS02                               (0x0004U)
#define GPIO_POSRC_POS03_POS                           (3U)
#define GPIO_POSRC_POS03                               (0x0008U)
#define GPIO_POSRC_POS04_POS                           (4U)
#define GPIO_POSRC_POS04                               (0x0010U)
#define GPIO_POSRC_POS05_POS                           (5U)
#define GPIO_POSRC_POS05                               (0x0020U)
#define GPIO_POSRC_POS06_POS                           (6U)
#define GPIO_POSRC_POS06                               (0x0040U)
#define GPIO_POSRC_POS07_POS                           (7U)
#define GPIO_POSRC_POS07                               (0x0080U)
#define GPIO_POSRC_POS08_POS                           (8U)
#define GPIO_POSRC_POS08                               (0x0100U)
#define GPIO_POSRC_POS09_POS                           (9U)
#define GPIO_POSRC_POS09                               (0x0200U)
#define GPIO_POSRC_POS10_POS                           (10U)
#define GPIO_POSRC_POS10                               (0x0400U)
#define GPIO_POSRC_POS11_POS                           (11U)
#define GPIO_POSRC_POS11                               (0x0800U)
#define GPIO_POSRC_POS12_POS                           (12U)
#define GPIO_POSRC_POS12                               (0x1000U)
#define GPIO_POSRC_POS13_POS                           (13U)
#define GPIO_POSRC_POS13                               (0x2000U)
#define GPIO_POSRC_POS14_POS                           (14U)
#define GPIO_POSRC_POS14                               (0x4000U)
#define GPIO_POSRC_POS15_POS                           (15U)
#define GPIO_POSRC_POS15                               (0x8000U)

/*  Bit definition for GPIO_PORRC register  */
#define GPIO_PORRC_POR00_POS                           (0U)
#define GPIO_PORRC_POR00                               (0x0001U)
#define GPIO_PORRC_POR01_POS                           (1U)
#define GPIO_PORRC_POR01                               (0x0002U)
#define GPIO_PORRC_POR02_POS                           (2U)
#define GPIO_PORRC_POR02                               (0x0004U)
#define GPIO_PORRC_POR03_POS                           (3U)
#define GPIO_PORRC_POR03                               (0x0008U)
#define GPIO_PORRC_POR04_POS                           (4U)
#define GPIO_PORRC_POR04                               (0x0010U)
#define GPIO_PORRC_POR05_POS                           (5U)
#define GPIO_PORRC_POR05                               (0x0020U)
#define GPIO_PORRC_POR06_POS                           (6U)
#define GPIO_PORRC_POR06                               (0x0040U)
#define GPIO_PORRC_POR07_POS                           (7U)
#define GPIO_PORRC_POR07                               (0x0080U)
#define GPIO_PORRC_POR08_POS                           (8U)
#define GPIO_PORRC_POR08                               (0x0100U)
#define GPIO_PORRC_POR09_POS                           (9U)
#define GPIO_PORRC_POR09                               (0x0200U)
#define GPIO_PORRC_POR10_POS                           (10U)
#define GPIO_PORRC_POR10                               (0x0400U)
#define GPIO_PORRC_POR11_POS                           (11U)
#define GPIO_PORRC_POR11                               (0x0800U)
#define GPIO_PORRC_POR12_POS                           (12U)
#define GPIO_PORRC_POR12                               (0x1000U)
#define GPIO_PORRC_POR13_POS                           (13U)
#define GPIO_PORRC_POR13                               (0x2000U)
#define GPIO_PORRC_POR14_POS                           (14U)
#define GPIO_PORRC_POR14                               (0x4000U)
#define GPIO_PORRC_POR15_POS                           (15U)
#define GPIO_PORRC_POR15                               (0x8000U)

/*  Bit definition for GPIO_POTRC register  */
#define GPIO_POTRC_POT00_POS                           (0U)
#define GPIO_POTRC_POT00                               (0x0001U)
#define GPIO_POTRC_POT01_POS                           (1U)
#define GPIO_POTRC_POT01                               (0x0002U)
#define GPIO_POTRC_POT02_POS                           (2U)
#define GPIO_POTRC_POT02                               (0x0004U)
#define GPIO_POTRC_POT03_POS                           (3U)
#define GPIO_POTRC_POT03                               (0x0008U)
#define GPIO_POTRC_POT04_POS                           (4U)
#define GPIO_POTRC_POT04                               (0x0010U)
#define GPIO_POTRC_POT05_POS                           (5U)
#define GPIO_POTRC_POT05                               (0x0020U)
#define GPIO_POTRC_POT06_POS                           (6U)
#define GPIO_POTRC_POT06                               (0x0040U)
#define GPIO_POTRC_POT07_POS                           (7U)
#define GPIO_POTRC_POT07                               (0x0080U)
#define GPIO_POTRC_POT08_POS                           (8U)
#define GPIO_POTRC_POT08                               (0x0100U)
#define GPIO_POTRC_POT09_POS                           (9U)
#define GPIO_POTRC_POT09                               (0x0200U)
#define GPIO_POTRC_POT10_POS                           (10U)
#define GPIO_POTRC_POT10                               (0x0400U)
#define GPIO_POTRC_POT11_POS                           (11U)
#define GPIO_POTRC_POT11                               (0x0800U)
#define GPIO_POTRC_POT12_POS                           (12U)
#define GPIO_POTRC_POT12                               (0x1000U)
#define GPIO_POTRC_POT13_POS                           (13U)
#define GPIO_POTRC_POT13                               (0x2000U)
#define GPIO_POTRC_POT14_POS                           (14U)
#define GPIO_POTRC_POT14                               (0x4000U)
#define GPIO_POTRC_POT15_POS                           (15U)
#define GPIO_POTRC_POT15                               (0x8000U)

/*  Bit definition for GPIO_PIDRD register  */
#define GPIO_PIDRD_PIN00_POS                           (0U)
#define GPIO_PIDRD_PIN00                               (0x0001U)
#define GPIO_PIDRD_PIN01_POS                           (1U)
#define GPIO_PIDRD_PIN01                               (0x0002U)
#define GPIO_PIDRD_PIN02_POS                           (2U)
#define GPIO_PIDRD_PIN02                               (0x0004U)
#define GPIO_PIDRD_PIN03_POS                           (3U)
#define GPIO_PIDRD_PIN03                               (0x0008U)
#define GPIO_PIDRD_PIN04_POS                           (4U)
#define GPIO_PIDRD_PIN04                               (0x0010U)
#define GPIO_PIDRD_PIN05_POS                           (5U)
#define GPIO_PIDRD_PIN05                               (0x0020U)
#define GPIO_PIDRD_PIN06_POS                           (6U)
#define GPIO_PIDRD_PIN06                               (0x0040U)
#define GPIO_PIDRD_PIN07_POS                           (7U)
#define GPIO_PIDRD_PIN07                               (0x0080U)
#define GPIO_PIDRD_PIN08_POS                           (8U)
#define GPIO_PIDRD_PIN08                               (0x0100U)
#define GPIO_PIDRD_PIN09_POS                           (9U)
#define GPIO_PIDRD_PIN09                               (0x0200U)
#define GPIO_PIDRD_PIN10_POS                           (10U)
#define GPIO_PIDRD_PIN10                               (0x0400U)
#define GPIO_PIDRD_PIN11_POS                           (11U)
#define GPIO_PIDRD_PIN11                               (0x0800U)
#define GPIO_PIDRD_PIN12_POS                           (12U)
#define GPIO_PIDRD_PIN12                               (0x1000U)
#define GPIO_PIDRD_PIN13_POS                           (13U)
#define GPIO_PIDRD_PIN13                               (0x2000U)
#define GPIO_PIDRD_PIN14_POS                           (14U)
#define GPIO_PIDRD_PIN14                               (0x4000U)
#define GPIO_PIDRD_PIN15_POS                           (15U)
#define GPIO_PIDRD_PIN15                               (0x8000U)

/*  Bit definition for GPIO_PODRD register  */
#define GPIO_PODRD_POUT00_POS                          (0U)
#define GPIO_PODRD_POUT00                              (0x0001U)
#define GPIO_PODRD_POUT01_POS                          (1U)
#define GPIO_PODRD_POUT01                              (0x0002U)
#define GPIO_PODRD_POUT02_POS                          (2U)
#define GPIO_PODRD_POUT02                              (0x0004U)
#define GPIO_PODRD_POUT03_POS                          (3U)
#define GPIO_PODRD_POUT03                              (0x0008U)
#define GPIO_PODRD_POUT04_POS                          (4U)
#define GPIO_PODRD_POUT04                              (0x0010U)
#define GPIO_PODRD_POUT05_POS                          (5U)
#define GPIO_PODRD_POUT05                              (0x0020U)
#define GPIO_PODRD_POUT06_POS                          (6U)
#define GPIO_PODRD_POUT06                              (0x0040U)
#define GPIO_PODRD_POUT07_POS                          (7U)
#define GPIO_PODRD_POUT07                              (0x0080U)
#define GPIO_PODRD_POUT08_POS                          (8U)
#define GPIO_PODRD_POUT08                              (0x0100U)
#define GPIO_PODRD_POUT09_POS                          (9U)
#define GPIO_PODRD_POUT09                              (0x0200U)
#define GPIO_PODRD_POUT10_POS                          (10U)
#define GPIO_PODRD_POUT10                              (0x0400U)
#define GPIO_PODRD_POUT11_POS                          (11U)
#define GPIO_PODRD_POUT11                              (0x0800U)
#define GPIO_PODRD_POUT12_POS                          (12U)
#define GPIO_PODRD_POUT12                              (0x1000U)
#define GPIO_PODRD_POUT13_POS                          (13U)
#define GPIO_PODRD_POUT13                              (0x2000U)
#define GPIO_PODRD_POUT14_POS                          (14U)
#define GPIO_PODRD_POUT14                              (0x4000U)
#define GPIO_PODRD_POUT15_POS                          (15U)
#define GPIO_PODRD_POUT15                              (0x8000U)

/*  Bit definition for GPIO_POERD register  */
#define GPIO_POERD_POUTE00_POS                         (0U)
#define GPIO_POERD_POUTE00                             (0x0001U)
#define GPIO_POERD_POUTE01_POS                         (1U)
#define GPIO_POERD_POUTE01                             (0x0002U)
#define GPIO_POERD_POUTE02_POS                         (2U)
#define GPIO_POERD_POUTE02                             (0x0004U)
#define GPIO_POERD_POUTE03_POS                         (3U)
#define GPIO_POERD_POUTE03                             (0x0008U)
#define GPIO_POERD_POUTE04_POS                         (4U)
#define GPIO_POERD_POUTE04                             (0x0010U)
#define GPIO_POERD_POUTE05_POS                         (5U)
#define GPIO_POERD_POUTE05                             (0x0020U)
#define GPIO_POERD_POUTE06_POS                         (6U)
#define GPIO_POERD_POUTE06                             (0x0040U)
#define GPIO_POERD_POUTE07_POS                         (7U)
#define GPIO_POERD_POUTE07                             (0x0080U)
#define GPIO_POERD_POUTE08_POS                         (8U)
#define GPIO_POERD_POUTE08                             (0x0100U)
#define GPIO_POERD_POUTE09_POS                         (9U)
#define GPIO_POERD_POUTE09                             (0x0200U)
#define GPIO_POERD_POUTE10_POS                         (10U)
#define GPIO_POERD_POUTE10                             (0x0400U)
#define GPIO_POERD_POUTE11_POS                         (11U)
#define GPIO_POERD_POUTE11                             (0x0800U)
#define GPIO_POERD_POUTE12_POS                         (12U)
#define GPIO_POERD_POUTE12                             (0x1000U)
#define GPIO_POERD_POUTE13_POS                         (13U)
#define GPIO_POERD_POUTE13                             (0x2000U)
#define GPIO_POERD_POUTE14_POS                         (14U)
#define GPIO_POERD_POUTE14                             (0x4000U)
#define GPIO_POERD_POUTE15_POS                         (15U)
#define GPIO_POERD_POUTE15                             (0x8000U)

