SoCXin/HC32F4A0/src/hc32f4a0tihb_template/common/hc32f4a0tihb.h
/*******************************************************************************
                Bit definition for Peripheral WDT
*******************************************************************************/
/*  Bit definition for WDT_CR register  */
#define WDT_CR_PERI_POS                                (0U)
#define WDT_CR_PERI                                    (0x00000003UL)
#define WDT_CR_PERI_0                                  (0x00000001UL)
#define WDT_CR_PERI_1                                  (0x00000002UL)
#define WDT_CR_CKS_POS                                 (4U)
#define WDT_CR_CKS                                     (0x000000F0UL)
#define WDT_CR_CKS_0                                   (0x00000010UL)
#define WDT_CR_CKS_1                                   (0x00000020UL)
#define WDT_CR_CKS_2                                   (0x00000040UL)
#define WDT_CR_CKS_3                                   (0x00000080UL)
#define WDT_CR_WDPT_POS                                (8U)
#define WDT_CR_WDPT                                    (0x00000F00UL)
#define WDT_CR_WDPT_0                                  (0x00000100UL)
#define WDT_CR_WDPT_1                                  (0x00000200UL)
#define WDT_CR_WDPT_2                                  (0x00000400UL)
#define WDT_CR_WDPT_3                                  (0x00000800UL)
#define WDT_CR_SLPOFF_POS                              (16U)
#define WDT_CR_SLPOFF                                  (0x00010000UL)
#define WDT_CR_ITS_POS                                 (31U)
#define WDT_CR_ITS                                     (0x80000000UL)

/*  Bit definition for WDT_SR register  */
#define WDT_SR_CNT_POS                                 (0U)
#define WDT_SR_CNT                                     (0x0000FFFFUL)
#define WDT_SR_UDF_POS                                 (16U)
#define WDT_SR_UDF                                     (0x00010000UL)
#define WDT_SR_REF_POS                                 (17U)
#define WDT_SR_REF                                     (0x00020000UL)

/*  Bit definition for WDT_RR register  */
#define WDT_RR_RF                                      (0x0000FFFFUL)


/******************************************************************************/
/*             Device Specific Registers bit_band structure                   */
/******************************************************************************/

typedef struct
{
    __IO uint32_t STRT;
    uint32_t RESERVED0[7];
} stc_adc_str_bit_t;

typedef struct
{
    __IO uint32_t MS0;
    __IO uint32_t MS1;
    uint32_t RESERVED0[2];
    __IO uint32_t ACCSEL0;
    __IO uint32_t ACCSEL1;
    __IO uint32_t CLREN;
    __IO uint32_t DFMT;
    uint32_t RESERVED1[8];
} stc_adc_cr0_bit_t;

typedef struct
{
    uint32_t RESERVED0[2];
    __IO uint32_t RSCHSEL;
    uint32_t RESERVED1[13];
} stc_adc_cr1_bit_t;

typedef struct
{
    __IO uint32_t TRGSELA0;
    __IO uint32_t TRGSELA1;
    uint32_t RESERVED0[5];
    __IO uint32_t TRGENA;
    __IO uint32_t TRGSELB0;
    __IO uint32_t TRGSELB1;
    uint32_t RESERVED1[5];
    __IO uint32_t TRGENB;
} stc_adc_trgsr_bit_t;

typedef struct
{
    __IO uint32_t EXCHSEL;
    uint32_t RESERVED0[7];
} stc_adc_exchselr_bit_t;

typedef struct
{
    uint32_t RESERVED0[16];
} stc_adc_shcr_bit_t;

typedef struct
{
    uint32_t RESERVED0[16];
} stc_adc_chmuxr_bit_t;

typedef struct
{
    __IO uint32_t EOCAF;
    __IO uint32_t EOCBF;
    uint32_t RESERVED0[2];
    __IO uint32_t SASTPDF;
    uint32_t RESERVED1[3];
} stc_adc_isr_bit_t;

typedef struct
{
    __IO uint32_t EOCAIEN;
    __IO uint32_t EOCBIEN;
    uint32_t RESERVED0[6];
} stc_adc_icr_bit_t;

typedef struct
{
    __IO uint32_t CLREOCAF;
    __IO uint32_t CLREOCBF;
    uint32_t RESERVED0[2];
    __IO uint32_t CLRSASTPDF;
    uint32_t RESERVED1[3];
} stc_adc_isclrr_bit_t;

typedef struct
{
    __IO uint32_t SYNCEN;
    uint32_t RESERVED0[3];
    __IO uint32_t SYNCMD0;
    __IO uint32_t SYNCMD1;
    __IO uint32_t SYNCMD2;
    uint32_t RESERVED1[9];
} stc_adc_synccr_bit_t;

typedef struct
{
    __IO uint32_t AWD0EN;
    __IO uint32_t AWD0IEN;
    __IO uint32_t AWD0MD;
    uint32_t RESERVED0[1];
    __IO uint32_t AWD1EN;
    __IO uint32_t AWD1IEN;
    __IO uint32_t AWD1MD;
    uint32_t RESERVED1[1];
    __IO uint32_t AWDCM0;
    __IO uint32_t AWDCM1;
    uint32_t RESERVED2[6];
} stc_adc_awdcr_bit_t;

typedef struct
{
    __IO uint32_t AWD0F;
    __IO uint32_t AWD1F;
    uint32_t RESERVED0[2];
    __IO uint32_t AWDCMF;
    uint32_t RESERVED1[3];
} stc_adc_awdsr_bit_t;

typedef struct
{
    __IO uint32_t CLRAWD0F;
    __IO uint32_t CLRAWD1F;
    uint32_t RESERVED0[2];
    __IO uint32_t CLRAWDCMF;
    uint32_t RESERVED1[3];
} stc_adc_awdsclrr_bit_t;

typedef struct
{
    __IO uint32_t AWDCH0;
    __IO uint32_t AWDCH1;
    __IO uint32_t AWDCH2;
    __IO uint32_t AWDCH3;
    __IO uint32_t AWDCH4;
    uint32_t RESERVED0[11];
} stc_adc_awd0chsr_bit_t;

typedef struct
{
    uint32_t RESERVED0[16];
} stc_adc_awd1chsr_bit_t;

typedef struct
{
    uint32_t RESERVED0[8];
} stc_adc_pgacr_bit_t;

typedef struct
{
    uint32_t RESERVED0[8];
} stc_adc_pgavssenr_bit_t;

typedef struct
{
    __IO uint32_t START;
    __IO uint32_t MODE;
    uint32_t RESERVED0[30];
} stc_aes_cr_bit_t;

typedef struct
{
    __IO uint32_t STRG;
    uint32_t RESERVED0[31];
} stc_aos_intsfttrg_bit_t;

typedef struct
{
    uint32_t RESERVED0[30];
    __IO uint32_t COMTRG_EN0;
    __IO uint32_t COMTRG_EN1;
} stc_aos_dcu_trgsel_bit_t;

typedef struct
{
    uint32_t RESERVED0[30];
    __IO uint32_t COMTRG_EN0;
    __IO uint32_t COMTRG_EN1;
} stc_aos_dma1_trgsel_bit_t;

typedef struct
{
    uint32_t RESERVED0[30];
    __IO uint32_t COMTRG_EN0;
    __IO uint32_t COMTRG_EN1;
} stc_aos_dma2_trgsel_bit_t;

typedef struct
{
    uint32_t RESERVED0[30];
    __IO uint32_t COMTRG_EN0;
    __IO uint32_t COMTRG_EN1;
} stc_aos_dma_trgselrc_bit_t;

typedef struct
{
    uint32_t RESERVED0[30];
    __IO uint32_t COMTRG_EN0;
    __IO uint32_t COMTRG_EN1;
} stc_aos_tmr6_htssr_bit_t;

typedef struct
{
    uint32_t RESERVED0[30];
    __IO uint32_t COMTRG_EN0;
    __IO uint32_t COMTRG_EN1;
} stc_aos_pevnttrgsr_bit_t;

typedef struct
{
    uint32_t RESERVED0[30];
    __IO uint32_t COMTRG_EN0;
    __IO uint32_t COMTRG_EN1;
} stc_aos_tmr0_htssr_bit_t;

typedef struct
{
    uint32_t RESERVED0[30];
    __IO uint32_t COMTRG_EN0;
    __IO uint32_t COMTRG_EN1;
} stc_aos_tmr2_htssr_bit_t;

typedef struct
{
    uint32_t RESERVED0[30];
    __IO uint32_t COMTRG_EN0;
    __IO uint32_t COMTRG_EN1;
} stc_aos_hash_itrgsela_bit_t;

typedef struct
{
    uint32_t RESERVED0[30];
    __IO uint32_t COMTRG_EN0;
    __IO uint32_t COMTRG_EN1;
} stc_aos_hash_itrgselb_bit_t;

typedef struct
{
    uint32_t RESERVED0[30];
    __IO uint32_t COMTRG_EN0;
    __IO uint32_t COMTRG_EN1;
} stc_aos_tmra_htssr_bit_t;

typedef struct
{
    uint32_t RESERVED0[30];
    __IO uint32_t COMTRG_EN0;
    __IO uint32_t COMTRG_EN1;
} stc_aos_ots_trg_bit_t;

typedef struct
{
    uint32_t RESERVED0[30];
    __IO uint32_t COMTRG_EN0;
    __IO uint32_t COMTRG_EN1;
} stc_aos_adc1_itrgselr_bit_t;

typedef struct
{
    uint32_t RESERVED0[30];
    __IO uint32_t COMTRG_EN0;
    __IO uint32_t COMTRG_EN1;
} stc_aos_adc2_itrgselr_bit_t;

typedef struct
{
    uint32_t RESERVED0[30];
    __IO uint32_t COMTRG_EN0;
    __IO uint32_t COMTRG_EN1;
} stc_aos_adc3_itrgselr_bit_t;

typedef struct
{
    __IO uint32_t PDIR00;
    __IO uint32_t PDIR01;
    __IO uint32_t PDIR02;
    __IO uint32_t PDIR03;
    __IO uint32_t PDIR04;
    __IO uint32_t PDIR05;
    __IO uint32_t PDIR06;
    __IO uint32_t PDIR07;
    __IO uint32_t PDIR08;
    __IO uint32_t PDIR09;
    __IO uint32_t PDIR10;
    __IO uint32_t PDIR11;
    __IO uint32_t PDIR12;
    __IO uint32_t PDIR13;
    __IO uint32_t PDIR14;
    __IO uint32_t PDIR15;
    uint32_t RESERVED0[16];
} stc_aos_pevntdirr_bit_t;

typedef struct
{
    __IO uint32_t PIN00;
    __IO uint32_t PIN01;
    __IO uint32_t PIN02;
    __IO uint32_t PIN03;
    __IO uint32_t PIN04;
    __IO uint32_t PIN05;
    __IO uint32_t PIN06;
    __IO uint32_t PIN07;
    __IO uint32_t PIN08;
    __IO uint32_t PIN09;
    __IO uint32_t PIN10;
    __IO uint32_t PIN11;
    __IO uint32_t PIN12;
    __IO uint32_t PIN13;
    __IO uint32_t PIN14;
    __IO uint32_t PIN15;
    uint32_t RESERVED0[16];
} stc_aos_pevntidr_bit_t;

typedef struct
{
    __IO uint32_t POUT00;
    __IO uint32_t POUT01;
    __IO uint32_t POUT02;
    __IO uint32_t POUT03;
    __IO uint32_t POUT04;
    __IO uint32_t POUT05;
    __IO uint32_t POUT06;
    __IO uint32_t POUT07;
    __IO uint32_t POUT08;
    __IO uint32_t POUT09;
    __IO uint32_t POUT10;
    __IO uint32_t POUT11;
    __IO uint32_t POUT12;
    __IO uint32_t POUT13;
    __IO uint32_t POUT14;
    __IO uint32_t POUT15;
    uint32_t RESERVED0[16];
} stc_aos_pevntodr_bit_t;

typedef struct
{
    __IO uint32_t POR00;
    __IO uint32_t POR01;
    __IO uint32_t POR02;
    __IO uint32_t POR03;
    __IO uint32_t POR04;
    __IO uint32_t POR05;
    __IO uint32_t POR06;
    __IO uint32_t POR07;
    __IO uint32_t POR08;
    __IO uint32_t POR09;
    __IO uint32_t POR10;
    __IO uint32_t POR11;
    __IO uint32_t POR12;
    __IO uint32_t POR13;
    __IO uint32_t POR14;
    __IO uint32_t POR15;
    uint32_t RESERVED0[16];
} stc_aos_pevntorr_bit_t;

typedef struct
{
    __IO uint32_t POS00;
    __IO uint32_t POS01;
    __IO uint32_t POS02;
    __IO uint32_t POS03;
    __IO uint32_t POS04;
    __IO uint32_t POS05;
    __IO uint32_t POS06;
    __IO uint32_t POS07;
    __IO uint32_t POS08;
    __IO uint32_t POS09;
    __IO uint32_t POS10;
    __IO uint32_t POS11;
    __IO uint32_t POS12;
    __IO uint32_t POS13;
    __IO uint32_t POS14;
    __IO uint32_t POS15;
    uint32_t RESERVED0[16];
} stc_aos_pevntosr_bit_t;

typedef struct
{
    __IO uint32_t RIS00;
    __IO uint32_t RIS01;
    __IO uint32_t RIS02;
    __IO uint32_t RIS03;
    __IO uint32_t RIS04;
    __IO uint32_t RIS05;
    __IO uint32_t RIS06;
    __IO uint32_t RIS07;
    __IO uint32_t RIS08;
    __IO uint32_t RIS09;
    __IO uint32_t RIS10;
    __IO uint32_t RIS11;
    __IO uint32_t RIS12;
    __IO uint32_t RIS13;
    __IO uint32_t RIS14;
    __IO uint32_t RIS15;
    uint32_t RESERVED0[16];
} stc_aos_pevntrisr_bit_t;

typedef struct
{
    __IO uint32_t FAL00;
    __IO uint32_t FAL01;
    __IO uint32_t FAL02;
    __IO uint32_t FAL03;
    __IO uint32_t FAL04;
    __IO uint32_t FAL05;
    __IO uint32_t FAL06;
    __IO uint32_t FAL07;
    __IO uint32_t FAL08;
    __IO uint32_t FAL09;
    __IO uint32_t FAL10;
    __IO uint32_t FAL11;
    __IO uint32_t FAL12;
    __IO uint32_t FAL13;
    __IO uint32_t FAL14;
    __IO uint32_t FAL15;
    uint32_t RESERVED0[16];
} stc_aos_pevntfal_bit_t;

typedef struct
{
    __IO uint32_t NFEN1;
    uint32_t RESERVED0[7];
    __IO uint32_t NFEN2;
    uint32_t RESERVED1[7];
    __IO uint32_t NFEN3;
    uint32_t RESERVED2[7];
    __IO uint32_t NFEN4;
    uint32_t RESERVED3[7];
} stc_aos_pevntnfcr_bit_t;

typedef struct
{
    __IO uint32_t BUSOFF;
    __IO uint32_t TACTIVE;
    __IO uint32_t RACTIVE;
    __IO uint32_t TSSS;
    __IO uint32_t TPSS;
    __IO uint32_t LBMI;
    __IO uint32_t LBME;
    __IO uint32_t RESET;
} stc_can_cfg_stat_bit_t;

typedef struct
{
    __IO uint32_t TSA;
    __IO uint32_t TSALL;
    __IO uint32_t TSONE;
    __IO uint32_t TPA;
    __IO uint32_t TPE;
    uint32_t RESERVED0[1];
    __IO uint32_t LOM;
    __IO uint32_t TBSEL;
} stc_can_tcmd_bit_t;

typedef struct
{
    __IO uint32_t TSSTAT0;
    __IO uint32_t TSSTAT1;
    uint32_t RESERVED0[2];
    __IO uint32_t TTTBM;
    __IO uint32_t TSMODE;
    __IO uint32_t TSNEXT;
    __IO uint32_t FD_ISO;
} stc_can_tctrl_bit_t;

typedef struct
{
    __IO uint32_t RSTAT0;
    __IO uint32_t RSTAT1;
    uint32_t RESERVED0[1];
    __IO uint32_t RBALL;
    __IO uint32_t RREL;
    __IO uint32_t ROV;
    __IO uint32_t ROM;
    __IO uint32_t SACK;
} stc_can_rctrl_bit_t;

typedef struct
{
    __IO uint32_t TSFF;
    __IO uint32_t EIE;
    __IO uint32_t TSIE;
    __IO uint32_t TPIE;
    __IO uint32_t RAFIE;
    __IO uint32_t RFIE;
    __IO uint32_t ROIE;
    __IO uint32_t RIE;
} stc_can_rtie_bit_t;

typedef struct
{
    __IO uint32_t AIF;
    __IO uint32_t EIF;
    __IO uint32_t TSIF;
    __IO uint32_t TPIF;
    __IO uint32_t RAFIF;
    __IO uint32_t RFIF;
    __IO uint32_t ROIF;
    __IO uint32_t RIF;
} stc_can_rtif_bit_t;

typedef struct
{
    __IO uint32_t BEIF;
    __IO uint32_t BEIE;
    __IO uint32_t ALIF;
    __IO uint32_t ALIE;
    __IO uint32_t EPIF;
    __IO uint32_t EPIE;
    __IO uint32_t EPASS;
    __IO uint32_t EWARN;
} stc_can_errint_bit_t;

typedef struct
{
    uint32_t RESERVED0[8];
} stc_can_limit_bit_t;

typedef struct
{
    uint32_t RESERVED0[8];
} stc_can_ealcap_bit_t;

typedef struct
{
    uint32_t RESERVED0[7];
    __IO uint32_t TDCEN;
} stc_can_tdc_bit_t;

typedef struct
{
    uint32_t RESERVED0[5];
    __IO uint32_t SELMASK;
    uint32_t RESERVED1[2];
} stc_can_acfctrl_bit_t;

typedef struct
{
    __IO uint32_t AE_1;
    __IO uint32_t AE_2;
    __IO uint32_t AE_3;
    __IO uint32_t AE_4;
    __IO uint32_t AE_5;
    __IO uint32_t AE_6;
    __IO uint32_t AE_7;
    __IO uint32_t AE_8;
    __IO uint32_t AE_9;
    __IO uint32_t AE_10;
    __IO uint32_t AE_11;
    __IO uint32_t AE_12;
    __IO uint32_t AE_13;
    __IO uint32_t AE_14;
    __IO uint32_t AE_15;
    __IO uint32_t AE_16;
} stc_can_acfen_bit_t;

typedef struct
{
    uint32_t RESERVED0[29];
    __IO uint32_t AIDE;
    __IO uint32_t AIDEE;
    uint32_t RESERVED1[1];
} stc_can_acf_bit_t;

typedef struct
{
    uint32_t RESERVED0[6];
    __IO uint32_t TBF;
    __IO uint32_t TBE;
} stc_can_tbslot_bit_t;

typedef struct
{
    __IO uint32_t TTEN;
    uint32_t RESERVED0[2];
    __IO uint32_t TTIF;
    __IO uint32_t TTIE;
    __IO uint32_t TEIF;
    __IO uint32_t WTIF;
    __IO uint32_t WTIE;
} stc_can_ttcfg_bit_t;

typedef struct
{
    uint32_t RESERVED0[31];
    __IO uint32_t REF_IDE;
} stc_can_ref_msg_bit_t;

typedef struct
{
    uint32_t RESERVED0[16];
} stc_can_trg_cfg_bit_t;

typedef struct
{
    __IO uint32_t CENB;
    __IO uint32_t CWDE;
    uint32_t RESERVED0[5];
    __IO uint32_t CMON;
} stc_cmp_mdr_bit_t;

typedef struct
{
    __IO uint32_t FCKS0;
    __IO uint32_t FCKS1;
    uint32_t RESERVED0[2];
    __IO uint32_t EDGS0;
    __IO uint32_t EDGS1;
    __IO uint32_t CIEN;
    uint32_t RESERVED1[1];
} stc_cmp_fir_bit_t;

typedef struct
{
    __IO uint32_t COEN;
    __IO uint32_t COPS;
    __IO uint32_t CPOE;
    __IO uint32_t TWOE;
    __IO uint32_t TWOL;
    uint32_t RESERVED0[3];
} stc_cmp_ocr_bit_t;

typedef struct
{
    __IO uint32_t RVSL0;
    __IO uint32_t RVSL1;
    __IO uint32_t RVSL2;
    __IO uint32_t RVSL3;
    __IO uint32_t CVSL0;
    __IO uint32_t CVSL1;
    __IO uint32_t CVSL2;
    __IO uint32_t CVSL3;
} stc_cmp_pmsr_bit_t;

typedef struct
{
    __IO uint32_t CTWS0;
    __IO uint32_t CTWS1;
    __IO uint32_t CTWS2;
    __IO uint32_t CTWS3;
    __IO uint32_t CTWS4;
    __IO uint32_t CTWS5;
    __IO uint32_t CTWS6;
    __IO uint32_t CTWS7;
    __IO uint32_t CTWS8;
    __IO uint32_t CTWS9;
    __IO uint32_t CTWS10;
    __IO uint32_t CTWS11;
    __IO uint32_t CTWS12;
    __IO uint32_t CTWS13;
    __IO uint32_t CTWS14;
    __IO uint32_t CTWS15;
} stc_cmp_twsr_bit_t;

typedef struct
{
    __IO uint32_t CTWP0;
    __IO uint32_t CTWP1;
    __IO uint32_t CTWP2;
    __IO uint32_t CTWP3;
    __IO uint32_t CTWP4;
    __IO uint32_t CTWP5;
    __IO uint32_t CTWP6;
    __IO uint32_t CTWP7;
    __IO uint32_t CTWP8;
    __IO uint32_t CTWP9;
    __IO uint32_t CTWP10;
    __IO uint32_t CTWP11;
    __IO uint32_t CTWP12;
    __IO uint32_t CTWP13;
    __IO uint32_t CTWP14;
    __IO uint32_t CTWP15;
} stc_cmp_twpr_bit_t;

typedef struct
{
    __IO uint32_t P2SL0;
    __IO uint32_t P2SL1;
    __IO uint32_t P2SL2;
    uint32_t RESERVED0[1];
    __IO uint32_t P3SL0;
    __IO uint32_t P3SL1;
    uint32_t RESERVED1[10];
} stc_cmp_visr_bit_t;

typedef struct
{
    __IO uint32_t XTAL32STP;
    uint32_t RESERVED0[7];
} stc_cmu_xtal32cr_bit_t;

typedef struct
{
    uint32_t RESERVED0[8];
} stc_cmu_xtal32cfgr_bit_t;

typedef struct
{
    uint32_t RESERVED0[8];
} stc_cmu_xtal32nfr_bit_t;

typedef struct
{
    __IO uint32_t LRCSTP;
    uint32_t RESERVED0[7];
} stc_cmu_lrccr_bit_t;

typedef struct
{
    __IO uint32_t RTCLRCSTP;
    uint32_t RESERVED0[7];
} stc_cmu_rtclrccr_bit_t;

typedef struct
{
    uint32_t RESERVED0[6];
    __IO uint32_t XTALMS;
    uint32_t RESERVED1[1];
} stc_cmu_xtalcfgr_bit_t;

typedef struct
{
    uint32_t RESERVED0[16];
} stc_cmu_pericksel_bit_t;

typedef struct
{
    uint32_t RESERVED0[16];
} stc_cmu_i2scksel_bit_t;

typedef struct
{
    uint32_t RESERVED0[8];
} stc_cmu_canckcfgr_bit_t;

typedef struct
{
    uint32_t RESERVED0[8];
} stc_cmu_usbckcfgr_bit_t;

typedef struct
{
    uint32_t RESERVED0[8];
} stc_cmu_ckswr_bit_t;

typedef struct
{
    __IO uint32_t PLLHOFF;
    uint32_t RESERVED0[7];
} stc_cmu_pllhcr_bit_t;

typedef struct
{
    __IO uint32_t PLLAOFF;
    uint32_t RESERVED0[7];
} stc_cmu_pllacr_bit_t;

typedef struct
{
    __IO uint32_t XTALSTP;
    uint32_t RESERVED0[7];
} stc_cmu_xtalcr_bit_t;

typedef struct
{
    __IO uint32_t HRCSTP;
    uint32_t RESERVED0[7];
} stc_cmu_hrccr_bit_t;

typedef struct
{
    __IO uint32_t MRCSTP;
    uint32_t RESERVED0[7];
} stc_cmu_mrccr_bit_t;

typedef struct
{
    __IO uint32_t HRCSTBF;
    uint32_t RESERVED0[2];
    __IO uint32_t XTALSTBF;
    uint32_t RESERVED1[1];
    __IO uint32_t PLLHSTBF;
    __IO uint32_t PLLASTBF;
    __IO uint32_t PLLBSTBF;
} stc_cmu_oscstbsr_bit_t;

typedef struct
{
    uint32_t RESERVED0[7];
    __IO uint32_t MCO1EN;
} stc_cmu_mco1cfgr_bit_t;

typedef struct
{
    uint32_t RESERVED0[7];
    __IO uint32_t MCO2EN;
} stc_cmu_mco2cfgr_bit_t;

typedef struct
{
    uint32_t RESERVED0[7];
    __IO uint32_t TPIUCKOE;
} stc_cmu_tpiuckcfgr_bit_t;

typedef struct
{
    __IO uint32_t XTALSTDIE;
    __IO uint32_t XTALSTDRE;
    __IO uint32_t XTALSTDRIS;
    uint32_t RESERVED0[4];
    __IO uint32_t XTALSTDE;
} stc_cmu_xtalstdcr_bit_t;

typedef struct
{
    __IO uint32_t XTALSTDF;
    uint32_t RESERVED0[7];
} stc_cmu_xtalstdsr_bit_t;

typedef struct
{
    uint32_t RESERVED0[8];
} stc_cmu_xtalstbcr_bit_t;

typedef struct
{
    uint32_t RESERVED0[7];
    __IO uint32_t PLLSRC;
    uint32_t RESERVED1[24];
} stc_cmu_pllhcfgr_bit_t;

typedef struct
{
    __IO uint32_t CR;
    __IO uint32_t FLAG;
    uint32_t RESERVED0[30];
} stc_crc_cr_bit_t;

typedef struct
{
    __IO uint32_t REFPSC0;
    __IO uint32_t REFPSC1;
    __IO uint32_t REFPSC2;
    uint32_t RESERVED0[1];
    __IO uint32_t REFCKS0;
    __IO uint32_t REFCKS1;
    __IO uint32_t ERRIE;
    __IO uint32_t CTCEN;
    uint32_t RESERVED1[24];
} stc_ctc_cr1_bit_t;

typedef struct
{
    __IO uint32_t OFSVAL0;
    __IO uint32_t OFSVAL1;
    __IO uint32_t OFSVAL2;
    __IO uint32_t OFSVAL3;
    __IO uint32_t OFSVAL4;
    __IO uint32_t OFSVAL5;
    __IO uint32_t OFSVAL6;
    __IO uint32_t OFSVAL7;
    uint32_t RESERVED0[24];
} stc_ctc_cr2_bit_t;

typedef struct
{
    __IO uint32_t TRIMOK;
    __IO uint32_t TRMOVF;
    __IO uint32_t TRMUDF;
    __IO uint32_t CTCBSY;
    uint32_t RESERVED0[28];
} stc_ctc_str_bit_t;

typedef struct
{
    __IO uint32_t DAE;
    __IO uint32_t DA1E;
    __IO uint32_t DA2E;
    uint32_t RESERVED0[5];
    __IO uint32_t DPSEL;
    __IO uint32_t DAAMP1;
    __IO uint32_t DAAMP2;
    __IO uint32_t EXTDSL1;
    __IO uint32_t EXTDSL2;
    uint32_t RESERVED1[3];
} stc_dac_dacr_bit_t;

typedef struct
{
    __IO uint32_t ADPSL1;
    __IO uint32_t ADPSL2;
    __IO uint32_t ADPSL3;
    uint32_t RESERVED0[5];
    __IO uint32_t DA1SF;
    __IO uint32_t DA2SF;
    uint32_t RESERVED1[5];
    __IO uint32_t ADPEN;
} stc_dac_daadpcr_bit_t;

typedef struct
{
    uint32_t RESERVED0[14];
    __IO uint32_t DAODIS1;
    __IO uint32_t DAODIS2;
} stc_dac_daocr_bit_t;

typedef struct
{
    __IO uint32_t MODE0;
    __IO uint32_t MODE1;
    __IO uint32_t MODE2;
    __IO uint32_t MODE3;
    __IO uint32_t DATASIZE0;
    __IO uint32_t DATASIZE1;
    uint32_t RESERVED0[2];
    __IO uint32_t COMP_TRG;
    uint32_t RESERVED1[22];
    __IO uint32_t INTEN;
} stc_dcu_ctl_bit_t;

typedef struct
{
    __IO uint32_t FLAG_OP;
    __IO uint32_t FLAG_LS2;
    __IO uint32_t FLAG_EQ2;
    __IO uint32_t FLAG_GT2;
    __IO uint32_t FLAG_LS1;
    __IO uint32_t FLAG_EQ1;
    __IO uint32_t FLAG_GT1;
    uint32_t RESERVED0[2];
    __IO uint32_t FLAG_RLD;
    __IO uint32_t FLAG_BTM;
    __IO uint32_t FLAG_TOP;
    uint32_t RESERVED1[20];
} stc_dcu_flag_bit_t;

typedef struct
{
    __IO uint32_t CLR_OP;
    __IO uint32_t CLR_LS2;
    __IO uint32_t CLR_EQ2;
    __IO uint32_t CLR_GT2;
    __IO uint32_t CLR_LS1;
    __IO uint32_t CLR_EQ1;
    __IO uint32_t CLR_GT1;
    uint32_t RESERVED0[2];
    __IO uint32_t CLR_RLD;
    __IO uint32_t CLR_BTM;
    __IO uint32_t CLR_TOP;
    uint32_t RESERVED1[20];
} stc_dcu_flagclr_bit_t;

typedef struct
{
    __IO uint32_t SEL_OP;
    __IO uint32_t SEL_LS2;
    __IO uint32_t SEL_EQ2;
    __IO uint32_t SEL_GT2;
    __IO uint32_t SEL_LS1;
    __IO uint32_t SEL_EQ1;
    __IO uint32_t SEL_GT1;
    __IO uint32_t SEL_WIN0;
    __IO uint32_t SEL_WIN1;
    __IO uint32_t SEL_RLD;
    __IO uint32_t SEL_BTM;
    __IO uint32_t SEL_TOP;
    uint32_t RESERVED0[20];
} stc_dcu_intevtsel_bit_t;

typedef struct
{
    __IO uint32_t EN;
    uint32_t RESERVED0[31];
} stc_dma_en_bit_t;

typedef struct
{
    __IO uint32_t TRNERR0;
    __IO uint32_t TRNERR1;
    __IO uint32_t TRNERR2;
    __IO uint32_t TRNERR3;
    __IO uint32_t TRNERR4;
    __IO uint32_t TRNERR5;
    __IO uint32_t TRNERR6;
    __IO uint32_t TRNERR7;
    uint32_t RESERVED0[8];
    __IO uint32_t REQERR0;
    __IO uint32_t REQERR1;
    __IO uint32_t REQERR2;
    __IO uint32_t REQERR3;
    __IO uint32_t REQERR4;
    __IO uint32_t REQERR5;
    __IO uint32_t REQERR6;
    __IO uint32_t REQERR7;
    uint32_t RESERVED1[8];
} stc_dma_intstat0_bit_t;

typedef struct
{
    __IO uint32_t TC0;
    __IO uint32_t TC1;
    __IO uint32_t TC2;
    __IO uint32_t TC3;
    __IO uint32_t TC4;
    __IO uint32_t TC5;
    __IO uint32_t TC6;
    __IO uint32_t TC7;
    uint32_t RESERVED0[8];
    __IO uint32_t BTC0;
    __IO uint32_t BTC1;
    __IO uint32_t BTC2;
    __IO uint32_t BTC3;
    __IO uint32_t BTC4;
    __IO uint32_t BTC5;
    __IO uint32_t BTC6;
    __IO uint32_t BTC7;
    uint32_t RESERVED1[8];
} stc_dma_intstat1_bit_t;

typedef struct
{
    __IO uint32_t MSKTRNERR0;
    __IO uint32_t MSKTRNERR1;
    __IO uint32_t MSKTRNERR2;
    __IO uint32_t MSKTRNERR3;
    __IO uint32_t MSKTRNERR4;
    __IO uint32_t MSKTRNERR5;
    __IO uint32_t MSKTRNERR6;
    __IO uint32_t MSKTRNERR7;
    uint32_t RESERVED0[8];
    __IO uint32_t MSKREQERR0;
    __IO uint32_t MSKREQERR1;
    __IO uint32_t MSKREQERR2;
    __IO uint32_t MSKREQERR3;
    __IO uint32_t MSKREQERR4;
    __IO uint32_t MSKREQERR5;
    __IO uint32_t MSKREQERR6;
    __IO uint32_t MSKREQERR7;
    uint32_t RESERVED1[8];
} stc_dma_intmask0_bit_t;

typedef struct
{
    __IO uint32_t MSKTC0;
    __IO uint32_t MSKTC1;
    __IO uint32_t MSKTC2;
    __IO uint32_t MSKTC3;
    __IO uint32_t MSKTC4;
    __IO uint32_t MSKTC5;
    __IO uint32_t MSKTC6;
    __IO uint32_t MSKTC7;
    uint32_t RESERVED0[8];
    __IO uint32_t MSKBTC0;
    __IO uint32_t MSKBTC1;
    __IO uint32_t MSKBTC2;
    __IO uint32_t MSKBTC3;
    __IO uint32_t MSKBTC4;
    __IO uint32_t MSKBTC5;
    __IO uint32_t MSKBTC6;
    __IO uint32_t MSKBTC7;
    uint32_t RESERVED1[8];
} stc_dma_intmask1_bit_t;

