SoCXin/HC32F4A0/src/hc32f4a0tihb_template/common/hc32f4a0tihb.h
typedef struct
{
    __IO uint32_t CLRTRNERR0;
    __IO uint32_t CLRTRNERR1;
    __IO uint32_t CLRTRNERR2;
    __IO uint32_t CLRTRNERR3;
    __IO uint32_t CLRTRNERR4;
    __IO uint32_t CLRTRNERR5;
    __IO uint32_t CLRTRNERR6;
    __IO uint32_t CLRTRNERR7;
    uint32_t RESERVED0[8];
    __IO uint32_t CLRREQERR0;
    __IO uint32_t CLRREQERR1;
    __IO uint32_t CLRREQERR2;
    __IO uint32_t CLRREQERR3;
    __IO uint32_t CLRREQERR4;
    __IO uint32_t CLRREQERR5;
    __IO uint32_t CLRREQERR6;
    __IO uint32_t CLRREQERR7;
    uint32_t RESERVED1[8];
} stc_dma_intclr0_bit_t;

typedef struct
{
    __IO uint32_t CLRTC0;
    __IO uint32_t CLRTC1;
    __IO uint32_t CLRTC2;
    __IO uint32_t CLRTC3;
    __IO uint32_t CLRTC4;
    __IO uint32_t CLRTC5;
    __IO uint32_t CLRTC6;
    __IO uint32_t CLRTC7;
    uint32_t RESERVED0[8];
    __IO uint32_t CLRBTC0;
    __IO uint32_t CLRBTC1;
    __IO uint32_t CLRBTC2;
    __IO uint32_t CLRBTC3;
    __IO uint32_t CLRBTC4;
    __IO uint32_t CLRBTC5;
    __IO uint32_t CLRBTC6;
    __IO uint32_t CLRBTC7;
    uint32_t RESERVED1[8];
} stc_dma_intclr1_bit_t;

typedef struct
{
    __IO uint32_t CHEN0;
    __IO uint32_t CHEN1;
    __IO uint32_t CHEN2;
    __IO uint32_t CHEN3;
    __IO uint32_t CHEN4;
    __IO uint32_t CHEN5;
    __IO uint32_t CHEN6;
    __IO uint32_t CHEN7;
    uint32_t RESERVED0[24];
} stc_dma_chen_bit_t;

typedef struct
{
    __IO uint32_t CHREQ0;
    __IO uint32_t CHREQ1;
    __IO uint32_t CHREQ2;
    __IO uint32_t CHREQ3;
    __IO uint32_t CHREQ4;
    __IO uint32_t CHREQ5;
    __IO uint32_t CHREQ6;
    __IO uint32_t CHREQ7;
    uint32_t RESERVED0[7];
    __IO uint32_t RCFGREQ;
    uint32_t RESERVED1[16];
} stc_dma_reqstat_bit_t;

typedef struct
{
    __IO uint32_t DMAACT;
    __IO uint32_t RCFGACT;
    uint32_t RESERVED0[14];
    __IO uint32_t CHACT0;
    __IO uint32_t CHACT1;
    __IO uint32_t CHACT2;
    __IO uint32_t CHACT3;
    __IO uint32_t CHACT4;
    __IO uint32_t CHACT5;
    __IO uint32_t CHACT6;
    __IO uint32_t CHACT7;
    uint32_t RESERVED1[8];
} stc_dma_chstat_bit_t;

typedef struct
{
    __IO uint32_t RCFGEN;
    __IO uint32_t RCFGLLP;
    uint32_t RESERVED0[14];
    __IO uint32_t SARMD0;
    __IO uint32_t SARMD1;
    __IO uint32_t DARMD0;
    __IO uint32_t DARMD1;
    __IO uint32_t CNTMD0;
    __IO uint32_t CNTMD1;
    uint32_t RESERVED1[10];
} stc_dma_rcfgctl_bit_t;

typedef struct
{
    __IO uint32_t CHENCLR0;
    __IO uint32_t CHENCLR1;
    __IO uint32_t CHENCLR2;
    __IO uint32_t CHENCLR3;
    __IO uint32_t CHENCLR4;
    __IO uint32_t CHENCLR5;
    __IO uint32_t CHENCLR6;
    __IO uint32_t CHENCLR7;
    uint32_t RESERVED0[24];
} stc_dma_chenclr_bit_t;

typedef struct
{
    __IO uint32_t SINC0;
    __IO uint32_t SINC1;
    __IO uint32_t DINC0;
    __IO uint32_t DINC1;
    __IO uint32_t SRTPEN;
    __IO uint32_t DRPTEN;
    __IO uint32_t SNSEQEN;
    __IO uint32_t DNSEQEN;
    __IO uint32_t HSIZE0;
    __IO uint32_t HSIZE1;
    __IO uint32_t LLPEN;
    __IO uint32_t LLPRUN;
    __IO uint32_t IE;
    uint32_t RESERVED0[19];
} stc_dma_chctl_bit_t;

typedef struct
{
    __IO uint32_t CAPEN;
    __IO uint32_t CAPMD;
    __IO uint32_t CROPEN;
    __IO uint32_t JPEGEN;
    __IO uint32_t SWSYNC;
    __IO uint32_t PIXCKSEL;
    __IO uint32_t HSYNCSEL;
    __IO uint32_t VSYNCSEL;
    __IO uint32_t CAPFRC0;
    __IO uint32_t CAPFRC1;
    __IO uint32_t BITSEL0;
    __IO uint32_t BITSEL1;
    uint32_t RESERVED0[2];
    __IO uint32_t DVPEN;
    uint32_t RESERVED1[17];
} stc_dvp_ctr_bit_t;

typedef struct
{
    __IO uint32_t FSF;
    __IO uint32_t LSF;
    __IO uint32_t LEF;
    __IO uint32_t FEF;
    __IO uint32_t SQUERF;
    __IO uint32_t FIFOERF;
    uint32_t RESERVED0[26];
} stc_dvp_str_bit_t;

typedef struct
{
    __IO uint32_t FSIEN;
    __IO uint32_t LSIEN;
    __IO uint32_t LEIEN;
    __IO uint32_t FEIEN;
    __IO uint32_t SQUERIEN;
    __IO uint32_t FIFOERIEN;
    uint32_t RESERVED0[26];
} stc_dvp_ier_bit_t;

typedef struct
{
    __IO uint32_t F0STP;
    __IO uint32_t F1STP;
    uint32_t RESERVED0[30];
} stc_efm_fstp_bit_t;

typedef struct
{
    uint32_t RESERVED0[8];
    __IO uint32_t LVM;
    uint32_t RESERVED1[7];
    __IO uint32_t ICACHE;
    __IO uint32_t DCACHE;
    __IO uint32_t PREFE;
    __IO uint32_t CRST;
    uint32_t RESERVED2[12];
} stc_efm_frmc_bit_t;

typedef struct
{
    uint32_t RESERVED0[8];
    __IO uint32_t BUSHLDCTL;
    uint32_t RESERVED1[7];
    __IO uint32_t KEY1LOCK;
    __IO uint32_t KEY2LOCK;
    uint32_t RESERVED2[14];
} stc_efm_fwmc_bit_t;

typedef struct
{
    __IO uint32_t OTPWERR0;
    __IO uint32_t PRTWERR0;
    __IO uint32_t PGSZERR0;
    __IO uint32_t MISMTCH0;
    __IO uint32_t OPTEND0;
    __IO uint32_t COLERR0;
    uint32_t RESERVED0[2];
    __IO uint32_t RDY0;
    uint32_t RESERVED1[8];
    __IO uint32_t PRTWERR1;
    __IO uint32_t PGSZERR1;
    __IO uint32_t MISMTCH1;
    __IO uint32_t OPTEND1;
    __IO uint32_t COLERR1;
    uint32_t RESERVED2[2];
    __IO uint32_t RDY1;
    uint32_t RESERVED3[7];
} stc_efm_fsr_bit_t;

typedef struct
{
    __IO uint32_t OTPWERRCLR0;
    __IO uint32_t PRTWERRCLR0;
    __IO uint32_t PGSZERRCLR0;
    __IO uint32_t MISMTCHCLR0;
    __IO uint32_t OPTENDCLR0;
    __IO uint32_t COLERRCLR0;
    uint32_t RESERVED0[11];
    __IO uint32_t PRTWERRCLR1;
    __IO uint32_t PGSZERRCLR1;
    __IO uint32_t MISMTCHCLR1;
    __IO uint32_t OPTENDCLR1;
    __IO uint32_t COLERRCLR1;
    uint32_t RESERVED1[10];
} stc_efm_fsclr_bit_t;

typedef struct
{
    __IO uint32_t PEERRITE;
    __IO uint32_t OPTENDITE;
    __IO uint32_t COLERRITE;
    uint32_t RESERVED0[29];
} stc_efm_fite_bit_t;

typedef struct
{
    __IO uint32_t FSWP;
    uint32_t RESERVED0[31];
} stc_efm_fswp_bit_t;

typedef struct
{
    uint32_t RESERVED0[31];
    __IO uint32_t EN0;
} stc_efm_mmf_remcr0_bit_t;

typedef struct
{
    uint32_t RESERVED0[31];
    __IO uint32_t EN1;
} stc_efm_mmf_remcr1_bit_t;

typedef struct
{
    __IO uint32_t WLOCK0;
    __IO uint32_t WLOCK1;
    __IO uint32_t WLOCK2;
    __IO uint32_t WLOCK3;
    __IO uint32_t WLOCK4;
    __IO uint32_t WLOCK5;
    __IO uint32_t WLOCK6;
    __IO uint32_t WLOCK7;
    uint32_t RESERVED0[24];
} stc_efm_wlock_bit_t;

typedef struct
{
    __IO uint32_t F0NWPRT0;
    __IO uint32_t F0NWPRT1;
    __IO uint32_t F0NWPRT2;
    __IO uint32_t F0NWPRT3;
    __IO uint32_t F0NWPRT4;
    __IO uint32_t F0NWPRT5;
    __IO uint32_t F0NWPRT6;
    __IO uint32_t F0NWPRT7;
    __IO uint32_t F0NWPRT8;
    __IO uint32_t F0NWPRT9;
    __IO uint32_t F0NWPRT10;
    __IO uint32_t F0NWPRT11;
    __IO uint32_t F0NWPRT12;
    __IO uint32_t F0NWPRT13;
    __IO uint32_t F0NWPRT14;
    __IO uint32_t F0NWPRT15;
    __IO uint32_t F0NWPRT16;
    __IO uint32_t F0NWPRT17;
    __IO uint32_t F0NWPRT18;
    __IO uint32_t F0NWPRT19;
    __IO uint32_t F0NWPRT20;
    __IO uint32_t F0NWPRT21;
    __IO uint32_t F0NWPRT22;
    __IO uint32_t F0NWPRT23;
    __IO uint32_t F0NWPRT24;
    __IO uint32_t F0NWPRT25;
    __IO uint32_t F0NWPRT26;
    __IO uint32_t F0NWPRT27;
    __IO uint32_t F0NWPRT28;
    __IO uint32_t F0NWPRT29;
    __IO uint32_t F0NWPRT30;
    __IO uint32_t F0NWPRT31;
} stc_efm_f0nwprt0_bit_t;

typedef struct
{
    __IO uint32_t F0NWPRT32;
    __IO uint32_t F0NWPRT33;
    __IO uint32_t F0NWPRT34;
    __IO uint32_t F0NWPRT35;
    __IO uint32_t F0NWPRT36;
    __IO uint32_t F0NWPRT37;
    __IO uint32_t F0NWPRT38;
    __IO uint32_t F0NWPRT39;
    __IO uint32_t F0NWPRT40;
    __IO uint32_t F0NWPRT41;
    __IO uint32_t F0NWPRT42;
    __IO uint32_t F0NWPRT43;
    __IO uint32_t F0NWPRT44;
    __IO uint32_t F0NWPRT45;
    __IO uint32_t F0NWPRT46;
    __IO uint32_t F0NWPRT47;
    __IO uint32_t F0NWPRT48;
    __IO uint32_t F0NWPRT49;
    __IO uint32_t F0NWPRT50;
    __IO uint32_t F0NWPRT51;
    __IO uint32_t F0NWPRT52;
    __IO uint32_t F0NWPRT53;
    __IO uint32_t F0NWPRT54;
    __IO uint32_t F0NWPRT55;
    __IO uint32_t F0NWPRT56;
    __IO uint32_t F0NWPRT57;
    __IO uint32_t F0NWPRT58;
    __IO uint32_t F0NWPRT59;
    __IO uint32_t F0NWPRT60;
    __IO uint32_t F0NWPRT61;
    __IO uint32_t F0NWPRT62;
    __IO uint32_t F0NWPRT63;
} stc_efm_f0nwprt1_bit_t;

typedef struct
{
    __IO uint32_t F0NWPRT64;
    __IO uint32_t F0NWPRT65;
    __IO uint32_t F0NWPRT66;
    __IO uint32_t F0NWPRT67;
    __IO uint32_t F0NWPRT68;
    __IO uint32_t F0NWPRT69;
    __IO uint32_t F0NWPRT70;
    __IO uint32_t F0NWPRT71;
    __IO uint32_t F0NWPRT72;
    __IO uint32_t F0NWPRT73;
    __IO uint32_t F0NWPRT74;
    __IO uint32_t F0NWPRT75;
    __IO uint32_t F0NWPRT76;
    __IO uint32_t F0NWPRT77;
    __IO uint32_t F0NWPRT78;
    __IO uint32_t F0NWPRT79;
    __IO uint32_t F0NWPRT80;
    __IO uint32_t F0NWPRT81;
    __IO uint32_t F0NWPRT82;
    __IO uint32_t F0NWPRT83;
    __IO uint32_t F0NWPRT84;
    __IO uint32_t F0NWPRT85;
    __IO uint32_t F0NWPRT86;
    __IO uint32_t F0NWPRT87;
    __IO uint32_t F0NWPRT88;
    __IO uint32_t F0NWPRT89;
    __IO uint32_t F0NWPRT90;
    __IO uint32_t F0NWPRT91;
    __IO uint32_t F0NWPRT92;
    __IO uint32_t F0NWPRT93;
    __IO uint32_t F0NWPRT94;
    __IO uint32_t F0NWPRT95;
} stc_efm_f0nwprt2_bit_t;

typedef struct
{
    __IO uint32_t F0NWPRT96;
    __IO uint32_t F0NWPRT97;
    __IO uint32_t F0NWPRT98;
    __IO uint32_t F0NWPRT99;
    __IO uint32_t F0NWPRT100;
    __IO uint32_t F0NWPRT101;
    __IO uint32_t F0NWPRT102;
    __IO uint32_t F0NWPRT103;
    __IO uint32_t F0NWPRT104;
    __IO uint32_t F0NWPRT105;
    __IO uint32_t F0NWPRT106;
    __IO uint32_t F0NWPRT107;
    __IO uint32_t F0NWPRT108;
    __IO uint32_t F0NWPRT109;
    __IO uint32_t F0NWPRT110;
    __IO uint32_t F0NWPRT111;
    __IO uint32_t F0NWPRT112;
    __IO uint32_t F0NWPRT113;
    __IO uint32_t F0NWPRT114;
    __IO uint32_t F0NWPRT115;
    __IO uint32_t F0NWPRT116;
    __IO uint32_t F0NWPRT117;
    __IO uint32_t F0NWPRT118;
    __IO uint32_t F0NWPRT119;
    __IO uint32_t F0NWPRT120;
    __IO uint32_t F0NWPRT121;
    __IO uint32_t F0NWPRT122;
    __IO uint32_t F0NWPRT123;
    __IO uint32_t F0NWPRT124;
    __IO uint32_t F0NWPRT125;
    __IO uint32_t F0NWPRT126;
    __IO uint32_t F0NWPRT127;
} stc_efm_f0nwprt3_bit_t;

typedef struct
{
    __IO uint32_t F1NWPRT0;
    __IO uint32_t F1NWPRT1;
    __IO uint32_t F1NWPRT2;
    __IO uint32_t F1NWPRT3;
    __IO uint32_t F1NWPRT4;
    __IO uint32_t F1NWPRT5;
    __IO uint32_t F1NWPRT6;
    __IO uint32_t F1NWPRT7;
    __IO uint32_t F1NWPRT8;
    __IO uint32_t F1NWPRT9;
    __IO uint32_t F1NWPRT10;
    __IO uint32_t F1NWPRT11;
    __IO uint32_t F1NWPRT12;
    __IO uint32_t F1NWPRT13;
    __IO uint32_t F1NWPRT14;
    __IO uint32_t F1NWPRT15;
    __IO uint32_t F1NWPRT16;
    __IO uint32_t F1NWPRT17;
    __IO uint32_t F1NWPRT18;
    __IO uint32_t F1NWPRT19;
    __IO uint32_t F1NWPRT20;
    __IO uint32_t F1NWPRT21;
    __IO uint32_t F1NWPRT22;
    __IO uint32_t F1NWPRT23;
    __IO uint32_t F1NWPRT24;
    __IO uint32_t F1NWPRT25;
    __IO uint32_t F1NWPRT26;
    __IO uint32_t F1NWPRT27;
    __IO uint32_t F1NWPRT28;
    __IO uint32_t F1NWPRT29;
    __IO uint32_t F1NWPRT30;
    __IO uint32_t F1NWPRT31;
} stc_efm_f1nwprt0_bit_t;

typedef struct
{
    __IO uint32_t F1NWPRT32;
    __IO uint32_t F1NWPRT33;
    __IO uint32_t F1NWPRT34;
    __IO uint32_t F1NWPRT35;
    __IO uint32_t F1NWPRT36;
    __IO uint32_t F1NWPRT37;
    __IO uint32_t F1NWPRT38;
    __IO uint32_t F1NWPRT39;
    __IO uint32_t F1NWPRT40;
    __IO uint32_t F1NWPRT41;
    __IO uint32_t F1NWPRT42;
    __IO uint32_t F1NWPRT43;
    __IO uint32_t F1NWPRT44;
    __IO uint32_t F1NWPRT45;
    __IO uint32_t F1NWPRT46;
    __IO uint32_t F1NWPRT47;
    __IO uint32_t F1NWPRT48;
    __IO uint32_t F1NWPRT49;
    __IO uint32_t F1NWPRT50;
    __IO uint32_t F1NWPRT51;
    __IO uint32_t F1NWPRT52;
    __IO uint32_t F1NWPRT53;
    __IO uint32_t F1NWPRT54;
    __IO uint32_t F1NWPRT55;
    __IO uint32_t F1NWPRT56;
    __IO uint32_t F1NWPRT57;
    __IO uint32_t F1NWPRT58;
    __IO uint32_t F1NWPRT59;
    __IO uint32_t F1NWPRT60;
    __IO uint32_t F1NWPRT61;
    __IO uint32_t F1NWPRT62;
    __IO uint32_t F1NWPRT63;
} stc_efm_f1nwprt1_bit_t;

typedef struct
{
    __IO uint32_t F1NWPRT64;
    __IO uint32_t F1NWPRT65;
    __IO uint32_t F1NWPRT66;
    __IO uint32_t F1NWPRT67;
    __IO uint32_t F1NWPRT68;
    __IO uint32_t F1NWPRT69;
    __IO uint32_t F1NWPRT70;
    __IO uint32_t F1NWPRT71;
    __IO uint32_t F1NWPRT72;
    __IO uint32_t F1NWPRT73;
    __IO uint32_t F1NWPRT74;
    __IO uint32_t F1NWPRT75;
    __IO uint32_t F1NWPRT76;
    __IO uint32_t F1NWPRT77;
    __IO uint32_t F1NWPRT78;
    __IO uint32_t F1NWPRT79;
    __IO uint32_t F1NWPRT80;
    __IO uint32_t F1NWPRT81;
    __IO uint32_t F1NWPRT82;
    __IO uint32_t F1NWPRT83;
    __IO uint32_t F1NWPRT84;
    __IO uint32_t F1NWPRT85;
    __IO uint32_t F1NWPRT86;
    __IO uint32_t F1NWPRT87;
    __IO uint32_t F1NWPRT88;
    __IO uint32_t F1NWPRT89;
    __IO uint32_t F1NWPRT90;
    __IO uint32_t F1NWPRT91;
    __IO uint32_t F1NWPRT92;
    __IO uint32_t F1NWPRT93;
    __IO uint32_t F1NWPRT94;
    __IO uint32_t F1NWPRT95;
} stc_efm_f1nwprt2_bit_t;

typedef struct
{
    __IO uint32_t F1NWPRT96;
    __IO uint32_t F1NWPRT97;
    __IO uint32_t F1NWPRT98;
    __IO uint32_t F1NWPRT99;
    __IO uint32_t F1NWPRT100;
    __IO uint32_t F1NWPRT101;
    __IO uint32_t F1NWPRT102;
    __IO uint32_t F1NWPRT103;
    __IO uint32_t F1NWPRT104;
    __IO uint32_t F1NWPRT105;
    __IO uint32_t F1NWPRT106;
    __IO uint32_t F1NWPRT107;
    __IO uint32_t F1NWPRT108;
    __IO uint32_t F1NWPRT109;
    __IO uint32_t F1NWPRT110;
    __IO uint32_t F1NWPRT111;
    __IO uint32_t F1NWPRT112;
    __IO uint32_t F1NWPRT113;
    __IO uint32_t F1NWPRT114;
    __IO uint32_t F1NWPRT115;
    __IO uint32_t F1NWPRT116;
    __IO uint32_t F1NWPRT117;
    __IO uint32_t F1NWPRT118;
    __IO uint32_t F1NWPRT119;
    __IO uint32_t F1NWPRT120;
    __IO uint32_t F1NWPRT121;
    __IO uint32_t F1NWPRT122;
    __IO uint32_t F1NWPRT123;
    __IO uint32_t F1NWPRT124;
    __IO uint32_t F1NWPRT125;
    __IO uint32_t F1NWPRT126;
    __IO uint32_t F1NWPRT127;
} stc_efm_f1nwprt3_bit_t;

typedef struct
{
    __IO uint32_t CMPEN0;
    __IO uint32_t CMPEN1;
    __IO uint32_t CMPEN2;
    __IO uint32_t CMPEN3;
    __IO uint32_t OSCSTPEN;
    __IO uint32_t PWMSEN0;
    __IO uint32_t PWMSEN1;
    __IO uint32_t PWMSEN2;
    __IO uint32_t PWMSEN3;
    __IO uint32_t PWMSEN4;
    __IO uint32_t PWMSEN5;
    __IO uint32_t PWMSEN6;
    __IO uint32_t PWMSEN7;
    uint32_t RESERVED0[3];
    __IO uint32_t PORTINEN1;
    __IO uint32_t PORTINEN2;
    __IO uint32_t PORTINEN3;
    __IO uint32_t PORTINEN4;
    uint32_t RESERVED1[2];
    __IO uint32_t INVSEL1;
    __IO uint32_t INVSEL2;
    __IO uint32_t INVSEL3;
    __IO uint32_t INVSEL4;
    uint32_t RESERVED2[6];
} stc_emb_ctl1_bit_t;

typedef struct
{
    __IO uint32_t PWMLV0;
    __IO uint32_t PWMLV1;
    __IO uint32_t PWMLV2;
    __IO uint32_t PWMLV3;
    __IO uint32_t PWMLV4;
    __IO uint32_t PWMLV5;
    __IO uint32_t PWMLV6;
    __IO uint32_t PWMLV7;
    uint32_t RESERVED0[8];
    __IO uint32_t NFSEL10;
    __IO uint32_t NFSEL11;
    __IO uint32_t NFEN1;
    __IO uint32_t NFSEL20;
    __IO uint32_t NFSEL21;
    __IO uint32_t NFEN2;
    __IO uint32_t NFSEL30;
    __IO uint32_t NFSEL31;
    __IO uint32_t NFEN3;
    __IO uint32_t NFSEL40;
    __IO uint32_t NFSEL41;
    __IO uint32_t NFEN4;
    uint32_t RESERVED1[4];
} stc_emb_ctl2_bit_t;

typedef struct
{
    __IO uint32_t SOE;
    uint32_t RESERVED0[31];
} stc_emb_soe_bit_t;

typedef struct
{
    uint32_t RESERVED0[1];
    __IO uint32_t PWMSF;
    __IO uint32_t CMPF;
    __IO uint32_t OSF;
    uint32_t RESERVED1[1];
    __IO uint32_t PWMST;
    __IO uint32_t CMPST;
    __IO uint32_t OSST;
    __IO uint32_t PORTINF1;
    __IO uint32_t PORTINF2;
    __IO uint32_t PORTINF3;
    __IO uint32_t PORTINF4;
    uint32_t RESERVED2[2];
    __IO uint32_t PORTINST1;
    __IO uint32_t PORTINST2;
    __IO uint32_t PORTINST3;
    __IO uint32_t PORTINST4;
    uint32_t RESERVED3[14];
} stc_emb_stat_bit_t;

typedef struct
{
    uint32_t RESERVED0[1];
    __IO uint32_t PWMSFCLR;
    __IO uint32_t CMPFCLR;
    __IO uint32_t OSFCLR;
    uint32_t RESERVED1[4];
    __IO uint32_t PORTINFCLR1;
    __IO uint32_t PORTINFCLR2;
    __IO uint32_t PORTINFCLR3;
    __IO uint32_t PORTINFCLR4;
    uint32_t RESERVED2[20];
} stc_emb_statclr_bit_t;

typedef struct
{
    uint32_t RESERVED0[1];
    __IO uint32_t PWMSINTEN;
    __IO uint32_t CMPINTEN;
    __IO uint32_t OSINTEN;
    uint32_t RESERVED1[4];
    __IO uint32_t PORTINTEN1;
    __IO uint32_t PORTINTEN2;
    __IO uint32_t PORTINTEN3;
    __IO uint32_t PORTINTEN4;
    uint32_t RESERVED2[20];
} stc_emb_inten_bit_t;

typedef struct
{
    uint32_t RESERVED0[1];
    __IO uint32_t PWMRSEL;
    __IO uint32_t CMPRSEL;
    __IO uint32_t OSRSEL;
    uint32_t RESERVED1[4];
    __IO uint32_t PORTINRSEL1;
    __IO uint32_t PORTINRSEL2;
    __IO uint32_t PORTINRSEL3;
    __IO uint32_t PORTINRSEL4;
    uint32_t RESERVED2[20];
} stc_emb_rlssel_bit_t;

typedef struct
{
    __IO uint32_t IFSEL;
    uint32_t RESERVED0[3];
    __IO uint32_t RCKINV;
    __IO uint32_t TCKINV;
    uint32_t RESERVED1[26];
} stc_eth_mac_ifconfr_bit_t;

typedef struct
{
    uint32_t RESERVED0[2];
    __IO uint32_t RE;
    __IO uint32_t TE;
    __IO uint32_t DC;
    __IO uint32_t BL0;
    __IO uint32_t BL1;
    __IO uint32_t ACS;
    uint32_t RESERVED1[1];
    __IO uint32_t DRTY;
    __IO uint32_t IPCO;
    __IO uint32_t DM;
    __IO uint32_t LM;
    __IO uint32_t DO;
    __IO uint32_t FES;
    uint32_t RESERVED2[1];
    __IO uint32_t DCRS;
    __IO uint32_t IFG0;
    __IO uint32_t IFG1;
    __IO uint32_t IFG2;
    uint32_t RESERVED3[2];
    __IO uint32_t MJB;
    __IO uint32_t MWD;
    uint32_t RESERVED4[1];
    __IO uint32_t CST;
    uint32_t RESERVED5[2];
    __IO uint32_t SAIRC0;
    __IO uint32_t SAIRC1;
    __IO uint32_t SAIRC2;
    uint32_t RESERVED6[1];
} stc_eth_mac_configr_bit_t;

typedef struct
{
    __IO uint32_t PR;
    __IO uint32_t HUC;
    __IO uint32_t HMC;
    __IO uint32_t DAIF;
    __IO uint32_t PMF;
    __IO uint32_t DBF;
    __IO uint32_t PCF0;
    __IO uint32_t PCF1;
    __IO uint32_t SAIF;
    __IO uint32_t SAF;
    __IO uint32_t HPF;
    uint32_t RESERVED0[5];
    __IO uint32_t VTFE;
    uint32_t RESERVED1[3];
    __IO uint32_t IPFE;
    __IO uint32_t DNTU;
    uint32_t RESERVED2[9];
    __IO uint32_t RA;
} stc_eth_mac_fltctlr_bit_t;

typedef struct
{
    __IO uint32_t SMIB;
    __IO uint32_t SMIW;
    __IO uint32_t SMIC0;
    __IO uint32_t SMIC1;
    __IO uint32_t SMIC2;
    __IO uint32_t SMIC3;
    __IO uint32_t SMIR0;
    __IO uint32_t SMIR1;
    __IO uint32_t SMIR2;
    __IO uint32_t SMIR3;
    __IO uint32_t SMIR4;
    __IO uint32_t SMIA0;
    __IO uint32_t SMIA1;
    __IO uint32_t SMIA2;
    __IO uint32_t SMIA3;
    __IO uint32_t SMIA4;
    uint32_t RESERVED0[16];
} stc_eth_mac_smiaddr_bit_t;

typedef struct
{
    __IO uint32_t FCA_BPA;
    __IO uint32_t TFE;
    __IO uint32_t RFE;
    __IO uint32_t UNP;
    __IO uint32_t PLT0;
    __IO uint32_t PLT1;
    uint32_t RESERVED0[1];
    __IO uint32_t DZPQ;
    uint32_t RESERVED1[24];
} stc_eth_mac_floctlr_bit_t;

typedef struct
{
    uint32_t RESERVED0[16];
    __IO uint32_t VTAL;
    __IO uint32_t VTIM;
    uint32_t RESERVED1[1];
    __IO uint32_t VTHM;
    uint32_t RESERVED2[12];
} stc_eth_mac_vtafltr_bit_t;

typedef struct
{
    __IO uint32_t MREA;
    __IO uint32_t MRS0;
    __IO uint32_t MRS1;
    uint32_t RESERVED0[1];
    __IO uint32_t RFWA;
    __IO uint32_t RFRS0;
    __IO uint32_t RFRS1;
    uint32_t RESERVED1[1];
    __IO uint32_t RFFL0;
    __IO uint32_t RFFL1;
    uint32_t RESERVED2[6];
    __IO uint32_t MTEA;
    __IO uint32_t MTS0;
    __IO uint32_t MTS1;
    __IO uint32_t MTP;
    __IO uint32_t TFRS0;
    __IO uint32_t TFRS1;
    __IO uint32_t TFWA;
    uint32_t RESERVED3[1];
    __IO uint32_t TFNE;
    __IO uint32_t TFF;
    uint32_t RESERVED4[6];
} stc_eth_mac_macstsr_bit_t;

typedef struct
{
    __IO uint32_t PWDN;
    __IO uint32_t MPEN;
    __IO uint32_t WKEN;
    uint32_t RESERVED0[2];
    __IO uint32_t MPFR;
    __IO uint32_t WKFR;
    uint32_t RESERVED1[2];
    __IO uint32_t GLUB;
    __IO uint32_t RTWKTR;
    uint32_t RESERVED2[13];
    __IO uint32_t RTWKPT0;
    __IO uint32_t RTWKPT1;
    __IO uint32_t RTWKPT2;
    uint32_t RESERVED3[4];
    __IO uint32_t RTWKFR;
} stc_eth_mac_pmtctlr_bit_t;

typedef struct
{
    uint32_t RESERVED0[3];
    __IO uint32_t PMTIS;
    __IO uint32_t MMCIS;
    __IO uint32_t MMCRXIS;
    __IO uint32_t MMCTXIS;
    uint32_t RESERVED1[2];
    __IO uint32_t TSPIS;
    uint32_t RESERVED2[22];
} stc_eth_mac_intstsr_bit_t;

typedef struct
{
    uint32_t RESERVED0[3];
    __IO uint32_t PMTIM;
    uint32_t RESERVED1[5];
    __IO uint32_t TSPIM;
    uint32_t RESERVED2[22];
} stc_eth_mac_intmskr_bit_t;

typedef struct
{
    uint32_t RESERVED0[31];
    __IO uint32_t AE0;
} stc_eth_mac_macadhr0_bit_t;

typedef struct
{
    uint32_t RESERVED0[24];
    __IO uint32_t MBC10;
    __IO uint32_t MBC11;
    __IO uint32_t MBC12;
    __IO uint32_t MBC13;
    __IO uint32_t MBC14;
    __IO uint32_t MBC15;
    __IO uint32_t SA1;
    __IO uint32_t AE1;
} stc_eth_mac_macadhr1_bit_t;

typedef struct
{
    uint32_t RESERVED0[24];
    __IO uint32_t MBC20;
    __IO uint32_t MBC21;
    __IO uint32_t MBC22;
    __IO uint32_t MBC23;
    __IO uint32_t MBC24;
    __IO uint32_t MBC25;
    __IO uint32_t SA2;
    __IO uint32_t AE2;
} stc_eth_mac_macadhr2_bit_t;

typedef struct
{
    uint32_t RESERVED0[24];
    __IO uint32_t MBC30;
    __IO uint32_t MBC31;
    __IO uint32_t MBC32;
    __IO uint32_t MBC33;
    __IO uint32_t MBC34;
    __IO uint32_t MBC35;
    __IO uint32_t SA3;
    __IO uint32_t AE3;
} stc_eth_mac_macadhr3_bit_t;

typedef struct
{
    uint32_t RESERVED0[24];
    __IO uint32_t MBC40;
    __IO uint32_t MBC41;
    __IO uint32_t MBC42;
    __IO uint32_t MBC43;
    __IO uint32_t MBC44;
    __IO uint32_t MBC45;
    __IO uint32_t SA4;
    __IO uint32_t AE4;
} stc_eth_mac_macadhr4_bit_t;

typedef struct
{
    __IO uint32_t CRST;
    __IO uint32_t COS;
    __IO uint32_t ROR;
    __IO uint32_t MCF;
    __IO uint32_t MCPSET;
    __IO uint32_t MCPSEL;
    uint32_t RESERVED0[26];
} stc_eth_mmc_mmcctlr_bit_t;

typedef struct
{
    uint32_t RESERVED0[3];
    __IO uint32_t RXBGIS;
    __IO uint32_t RXMGIS;
    __IO uint32_t RXCEIS;
    __IO uint32_t RXAEIS;
    __IO uint32_t RXREIS;
    uint32_t RESERVED1[9];
    __IO uint32_t RXUGIS;
    __IO uint32_t RXLEIS;
    __IO uint32_t RXOEIS;
    uint32_t RESERVED2[12];
} stc_eth_mmc_revstsr_bit_t;

typedef struct
{
    uint32_t RESERVED0[2];
    __IO uint32_t TXBGIS;
    __IO uint32_t TXMGIS;
    uint32_t RESERVED1[12];
    __IO uint32_t TXDEEIS;
    __IO uint32_t TXLCEIS;
    __IO uint32_t TXECEIS;
    __IO uint32_t TXCAEIS;
    uint32_t RESERVED2[1];
    __IO uint32_t TXUGIS;
    __IO uint32_t TXEDEIS;
    uint32_t RESERVED3[9];
} stc_eth_mmc_trsstsr_bit_t;

typedef struct
{
    uint32_t RESERVED0[3];
    __IO uint32_t RXBGIM;
    __IO uint32_t RXMGIM;
    __IO uint32_t RXCEIM;
    __IO uint32_t RXAEIM;
    __IO uint32_t RXREIM;
    uint32_t RESERVED1[9];
    __IO uint32_t RXUGIM;
    __IO uint32_t RXLEIM;
    __IO uint32_t RXOEIM;
    uint32_t RESERVED2[12];
} stc_eth_mmc_ritctlr_bit_t;

typedef struct
{
    uint32_t RESERVED0[2];
    __IO uint32_t TXBGIM;
    __IO uint32_t TXMGIM;
    uint32_t RESERVED1[12];
    __IO uint32_t TXDEEIM;
    __IO uint32_t TXLCEIM;
    __IO uint32_t TXECEIM;
    __IO uint32_t TXCAEIM;
    uint32_t RESERVED2[1];
    __IO uint32_t TXUGIM;
    __IO uint32_t TXEDEIM;
    uint32_t RESERVED3[9];
} stc_eth_mmc_titctlr_bit_t;

